// chaptersData.js
export const chaptersData = {
    1: {
      title: "الحث الكهرومغناطيسي",
      lessons: {
        "1-1": "التيار الكهربائي الناتج عن تغير المجالات المغناطيسية",
        "1-2": "تغير المجالات المغناطيسية يولد قوة دافعة كهربائية حثية"
      }
    },
    2: {
      title: "الكهرومغناطيسية",
      lessons: {
        "2-1": "تفاعلات المجالات الكهربائية والمغناطيسية والمادة",
        "2-2": "المجالات الكهربائية والمغناطيسية في الفضاء"
      }
    },
    3: {
      title: "نظرية الكم",
      lessons: {
        "3-1": "النموذج الجسيمي للموجات",
        "3-2": "موجات المادة"
      }
    },
    4: {
      title: "الذرة",
      lessons: {
        "4-1": "نموذج بور الذري",
        "4-2": "النموذج الكمي للذرة"
      }
    },
    5: {
      title: "إلكترونيات الحالة الصلبة",
      lessons: {
        "5-1": "التوصيل الكهربائي في المواد الصلبة",
        "5-2": "الأدوات الإلكترونية"
      }
    },
    6: {
      title: "الفيزياء النووية",
      lessons: {
        "6-1": "النواة",
        "6-2": "الاضمحلال النووي والتفاعلات النووية",
        "6-3": "وحدات بناء المادة"
      }
    }
  };